tap "codecrafters-io/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "teamookla/speedtest"
brew "btop"
brew "gcc"
brew "git"
brew "go"
brew "goose"
brew "openjdk"
brew "gradle"
brew "icu4c@76"
brew "jq"
brew "llvm"
brew "maven"
brew "tree-sitter"
brew "neovim"
brew "nvm"
brew "openjdk@11"
brew "ripgrep"
brew "sqlc"
brew "tailwindcss"
brew "tree"
brew "tree-sitter-cli"
brew "xclip"
brew "zsh-autosuggestions"
brew "codecrafters-io/tap/codecrafters"
brew "teamookla/speedtest/speedtest"
cask "dbeaver-community"
cask "ghostty"
cask "iterm2"
cask "jetbrains-toolbox"
cask "postman"
cask "visual-studio-code"
cask "zed"
vscode "a-h.templ"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscode-icons-team.vscode-icons"
go "github.com/air-verse/air"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/a-h/templ/cmd/templ"
npm "corepack"
